#Дан следующий словарь:
#Найдите сумму элементов этого словаря.

dct = {
	1: {
		1: 11,
		2: 12,
		3: 13,
	},
	2: {
		1: 21,
		2: 22,
		3: 23,
	},
	3: {
		1: 24,
		2: 25,
		3: 26,
	},
}

total = 0
for i in dct:
   total = total + sum(dct[i].values())
print(total)